In [8]:
import pandas as pd

df=pd.DataFrame([['L','blue',34.0],['XL','green',23.23],['M','white',56],['XL','green',90]],
            columns=['Size','color','price'])

In [9]:
df

  Size  color  price
0    L   blue  34.00
1   XL  green  23.23
2    M  white  56.00
3   XL  green  90.00

In [10]:
#size : ordinal
#color :nominal

**One-Hot Encoding**
   - if we have Nominal categorical column
    
**Label Encoding**
  - if we have Ordinal categorical column

### One hot Encoding

In [11]:
f = pd.get_dummies(df['color'])
f

   blue  green  white
0     1      0      0
1     0      1      0
2     0      0      1
3     0      1      0

### Label Encoding

In [12]:
#XL>L>M

In [13]:
df['Size'] = df.Size.map({'M':1,'L':2,'XL':3})

In [14]:
df

   Size  color  price
0     2   blue  34.00
1     3  green  23.23
2     1  white  56.00
3     3  green  90.00

In [15]:
### concatenation

In [16]:
f2 = df.drop('color',axis=1)
f2

   Size  price
0     2  34.00
1     3  23.23
2     1  56.00
3     3  90.00

In [17]:
final_data = pd.concat((f2,f),axis=1)
final_data

   Size  price  blue  green  white
0     2  34.00     1      0      0
1     3  23.23     0      1      0
2     1  56.00     0      0      1
3     3  90.00     0      1      0

In [18]:
import pandas as pd

In [19]:
df = pd.read_csv('income.csv',na_values=['?'])

In [20]:
df.head()

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,25,Private,226802,11th,7,Never-married,Machine-op-inspct,Own-child,Black,Male,0,0,40,United-States,<=50K
1,38,Private,89814,HS-grad,9,Married-civ-spouse,Farming-fishing,Husband,White,Male,0,0,50,United-States,<=50K
2,28,Local-gov,336951,Assoc-acdm,12,Married-civ-spouse,Protective-serv,Husband,White,Male,0,0,40,United-States,>50K
3,44,Private,160323,Some-college,10,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,7688,0,40,United-States,>50K
4,18,NaN,103497,Some-college,10,Never-married,NaN,Own-child,White,Female,0,0,30,United-States,<=50K

In [21]:
df.income.value_counts()

<=50K    37155
>50K     11687
Name: income, dtype: int64

In [22]:
target_var = df.income

In [23]:
df.isnull().sum()

age                   0
workclass          2799
fnlwgt                0
education             0
educational-num       0
marital-status        0
occupation         2809
relationship          0
race                  0
gender                0
capital-gain          0
capital-loss          0
hours-per-week        0
native-country      857
income                0
dtype: int64

In [24]:
df['native-country'].mode()[0]

'United-States'

In [25]:
df.shape

(48842, 15)

In [26]:
df.dtypes

age                 int64
workclass          object
fnlwgt              int64
education          object
educational-num     int64
marital-status     object
occupation         object
relationship       object
race               object
gender             object
capital-gain        int64
capital-loss        int64
hours-per-week      int64
native-country     object
income             object
dtype: object

In [27]:
df.dropna(inplace=True)

In [28]:
#df.fillna({'workclass':df.workclass.mode()[0],'occupation':df.occupation.mode()[0],
#          'native-country':df['native-country'].mode()[0]},inplace=True)

In [29]:
df.isnull().sum()

age                0
workclass          0
fnlwgt             0
education          0
educational-num    0
marital-status     0
occupation         0
relationship       0
race               0
gender             0
capital-gain       0
capital-loss       0
hours-per-week     0
native-country     0
income             0
dtype: int64

In [30]:
df.shape

(45222, 15)

### Deal with categorical columns

In [31]:
### display all categorical columns

In [35]:
cols = df.drop('income',axis=1).select_dtypes(include=['object'])

In [36]:
cols.head()

,workclass,education,marital-status,occupation,relationship,race,gender,native-country
0,Private,11th,Never-married,Machine-op-inspct,Own-child,Black,Male,United-States
1,Private,HS-grad,Married-civ-spouse,Farming-fishing,Husband,White,Male,United-States
2,Local-gov,Assoc-acdm,Married-civ-spouse,Protective-serv,Husband,White,Male,United-States
3,Private,Some-college,Married-civ-spouse,Machine-op-inspct,Husband,Black,Male,United-States
5,Private,10th,Never-married,Other-service,Not-in-family,White,Male,United-States

In [37]:
d=[]
for i in cols:
    s = df[i].nunique()
    if s>0:
        d.append(s)
        print('{} has {} categories'.format(i,s))

workclass has 7 categories
education has 16 categories
marital-status has 7 categories
occupation has 14 categories
relationship has 6 categories
race has 5 categories
gender has 2 categories
native-country has 41 categories

In [38]:
d

[7, 16, 7, 14, 6, 5, 2, 41]

In [39]:
sum(d)

98

In [40]:
df.shape

(45222, 15)

In [41]:
#US
#others

In [27]:
df['native-country'].unique()

array(['United-States', 'Peru', 'Guatemala', 'Mexico',
       'Dominican-Republic', 'Ireland', 'Germany', 'Philippines',
       'Thailand', 'Haiti', 'El-Salvador', 'Puerto-Rico', 'Vietnam',
       'South', 'Columbia', 'Japan', 'India', 'Cambodia', 'Poland',
       'Laos', 'England', 'Cuba', 'Taiwan', 'Italy', 'Canada', 'Portugal',
       'China', 'Nicaragua', 'Honduras', 'Iran', 'Scotland', 'Jamaica',
       'Ecuador', 'Yugoslavia', 'Hungary', 'Hong', 'Greece',
       'Trinadad&Tobago', 'Outlying-US(Guam-USVI-etc)', 'France',
       'Holand-Netherlands'], dtype=object)

In [42]:
m = []

for i in df['native-country']:
    if i=='United-States':
        m.append('US')
    else:
        m.append('others')

In [43]:
#m

In [44]:
df['native-country'] = m

In [45]:
cols['native-country'] =m

In [46]:
df['native-country'].value_counts()

US        41292
others     3930
Name: native-country, dtype: int64

In [47]:
d=[]
for i in cols:
    s = df[i].nunique()
    if s>0:
        d.append(s)
        print('{} has {} categories'.format(i,s))

workclass has 7 categories
education has 16 categories
marital-status has 7 categories
occupation has 14 categories
relationship has 6 categories
race has 5 categories
gender has 2 categories
native-country has 2 categories

In [34]:
sum(d)

59

In [38]:
f1 = pd.get_dummies(cols)

In [39]:
f1.head()

,workclass_Federal-gov,workclass_Local-gov,workclass_Private,workclass_Self-emp-inc,workclass_Self-emp-not-inc,workclass_State-gov,workclass_Without-pay,education_10th,education_11th,education_12th,...,relationship_Wife,race_Amer-Indian-Eskimo,race_Asian-Pac-Islander,race_Black,race_Other,race_White,gender_Female,gender_Male,native-country_US,native-country_others
0,0,0,1,0,0,0,0,0,1,0,...,0,0,0,1,0,0,0,1,1,0
1,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,1,1,0
2,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,1,0,1,1,0
3,0,0,1,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,1,1,0
5,0,0,1,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,1,1,0

In [40]:
f2 = df.select_dtypes(exclude=['object'])

In [41]:
f2.head()

   age  fnlwgt  educational-num  capital-gain  capital-loss  hours-per-week
0   25  226802                7             0             0              40
1   38   89814                9             0             0              50
2   28  336951               12             0             0              40
3   44  160323               10          7688             0              40
5   34  198693                6             0             0              30

In [42]:
f2.shape

(45222, 6)

In [43]:
f1.shape

(45222, 59)

In [44]:
final_data = pd.concat((f2,f1),axis=1)

In [45]:
final_data.head()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week,workclass_Federal-gov,workclass_Local-gov,workclass_Private,workclass_Self-emp-inc,...,relationship_Wife,race_Amer-Indian-Eskimo,race_Asian-Pac-Islander,race_Black,race_Other,race_White,gender_Female,gender_Male,native-country_US,native-country_others
0,25,226802,7,0,0,40,0,0,1,0,...,0,0,0,1,0,0,0,1,1,0
1,38,89814,9,0,0,50,0,0,1,0,...,0,0,0,0,0,1,0,1,1,0
2,28,336951,12,0,0,40,0,1,0,0,...,0,0,0,0,0,1,0,1,1,0
3,44,160323,10,7688,0,40,0,0,1,0,...,0,0,0,1,0,0,0,1,1,0
5,34,198693,6,0,0,30,0,0,1,0,...,0,0,0,0,0,1,0,1,1,0

In [46]:
final_data.shape

(45222, 65)

In [47]:
final_data.dtypes

age                      int64
fnlwgt                   int64
educational-num          int64
capital-gain             int64
capital-loss             int64
                         ...
race_White               uint8
gender_Female            uint8
gender_Male              uint8
native-country_US        uint8
native-country_others    uint8
Length: 65, dtype: object